STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.c
  BSP_LCD_GLASS_DisplayString(ptr);
  HAL_Delay(ScrollSpeed);

  /* To shift the string for scrolling display*/
  for (repetition = 0; repetition < nScroll; repetition++)
  {
    for(nbrchar = 0; nbrchar < sizestr; nbrchar++)
    {
      *(str) =* (ptr1+((nbrchar)%sizestr));
      *(str+1) =* (ptr1+((nbrchar+1)%sizestr));
      *(str+2) =* (ptr1+((nbrchar+2)%sizestr));
      *(str+3) =* (ptr1+((nbrchar+3)%sizestr));
      *(str+4) =* (ptr1+((nbrchar+4)%sizestr));
      *(str+5) =* (ptr1+((nbrchar+5)%sizestr));
      *(str+6) =* (ptr1+((nbrchar+6)%sizestr));
      *(str+7) =* (ptr1+((nbrchar+7)%sizestr));
      BSP_LCD_GLASS_ClearTextZone();
      BSP_LCD_GLASS_DisplayString(str);

      HAL_Delay(ScrollSpeed);
    }
  }
}

/**
  * @brief  Configure ST Logo display.
  * @param  NewState: enable or disable the logo display .
  * @retval None
  */
void BSP_LCD_GLASS_DisplayLogo(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    /* Set logo on  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFFBF, 0x00000040);
  }
  else
  {
    /* Set logo of  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFFBF, 0);
  }

  /*!< Request LCD RAM update */
  HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/**
  * @brief  Configure the LCD ArrowDirection.
  * @param  ArrowDirection: Specify the ArrowDirection to set.
  * @retval None
  */
void BSP_LCD_GLASS_ArrowConfig(ArrowDirection_TypeDef ArrowDirection)
{
  switch (ArrowDirection)
  {
    /* ARROWDIRECTION_UP */
    case ARROWDIRECTION_UP:
      /* Set ARROWDIRECTION_UP on  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFEFFF, 0x00001000);
      break;

    /* ARROWDIRECTION_LEFT */
    case ARROWDIRECTION_LEFT :
      /* Set ARROWDIRECTION_LEFT on  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFEFFF, 0x00001000);
      break;

    /* ARROWDIRECTION_DOWN */
    case ARROWDIRECTION_DOWN:
      /* Set ARROWDIRECTION_DOWN on  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFF7FFF, 0x00008000);
      break;

    /* ARROWDIRECTION_RIGHT */
    case ARROWDIRECTION_RIGHT:
      /* Set ARROWDIRECTION_RIGHT on  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFF7FFF, 0x00008000);
      break;

    case ARROWDIRECTION_OFF:
      /* Set ARROWDIRECTION_UP off  */
      /* Set ARROWDIRECTION_RIGHT off  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFF6FFF, 0);
      /* Set ARROWDIRECTION_LEFT off  */
      /* Set ARROWDIRECTION_DOWN off  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFF6FFF, 0);
      break;

    default:
      break;
  }

  /*!< Request LCD RAM update */
  HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/**
  * @brief  Configure the LCD Temperature level display .
  * @param  Temperature: indicate the Temperature level to set.
  * @retval None
  */
void BSP_LCD_GLASS_TemperatureConfig(TemperatureLevel_TypeDef Temperature)
{
  switch (Temperature)
  {
    /* Temperature level 1*/
    case TEMPERATURELEVEL_1 :
      /* Clear Temperature level 5 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0);
      /* Clear Temperature level 4 and level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0);
      /* Clear Temperature level 1 and level 3 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0);
      /* Set Temperature level 1*/
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0x00000200);
      break;

    /* Temperature level 2 */
    case TEMPERATURELEVEL_2:
      /* Clear Temperature level 4 and level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0);
      /* Clear Temperature level 1 and level 3 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0);
      /* Set Temperature level 1 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0x00000200);
      break;

      /* Temperature level 3 */
    case TEMPERATURELEVEL_3:
      /* Clear Temperature level 1 and level 3 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0);
      /* Set Temperature level 1 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 3 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0x00000400);
      break;

      /* Temperature level 4*/
    case TEMPERATURELEVEL_4:
      /* Set Temperature level 1  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 2  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 3 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0x00000400);
      /* Set Temperature level 4 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0x00000400);
      break;

      /* Temperature_2*/
    case TEMPERATURELEVEL_5:
      /* Set Temperature level 1 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 3 and level 5 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0x00000C00);
      /* Set Temperature level 4 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0x00000400);
      break;

      /* Temperature_6*/
    case  TEMPERATURELEVEL_6:
      /* Set Temperature level 1 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0x00000200);
      /* Set Temperature level 3 and level 5 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0x00000C00);
      /* Set Temperature level 4 and level 6 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0x00000C00);
      break;

    case TEMPERATURELEVEL_OFF:
      /* Clear Temperature level 5 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFFFDFF, 0);
      /* Clear Temperature level 6 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFDFF, 0);
      /* Clear Temperature level 4 and level 2 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFFF3FF, 0);
      /* Clear Temperature level 1 and level 3 */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFFF3FF, 0);
      break;

    default:
      break;
  }

  /*!< Request LCD RAM update */
  HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/**
  * @brief  Configure the LCD Value Unit.
  * @param  ValueUnit: indicate the Value Unit to set.
  * @retval None
  */
void BSP_LCD_GLASS_ValueUnitConfig(ValueUnit_TypeDef ValueUnit)
{
  switch (ValueUnit)
  {
    /* VALUEUNIT MILLIAMPERE*/
    case VALUEUNIT_MILLIAMPERE:
      /* Set VALUEUNIT_MILLIAMPERE on  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFBFFFF, 0x00040000);
      break;

    /* VALUEUNIT MICROAMPERE)*/
    case VALUEUNIT_MICROAMPERE:
      /* Set VALUEUNIT_MICROAMPERE  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xFFFBFFFF, 0x00040000);
      break;

    /* VALUEUNIT NANOAMPERE*/
    case  VALUEUNIT_NANOAMPERE:
      /* Set VALUEUNIT_NANOAMPERE on  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xFFFFFFBF, 0x00000040);
      break;

