STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.c
        case PIXELCOLUMN_17:
          /* Position : Row = 10 , Column= 17*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER9, ~((uint32_t)0x00000020), (uint32_t)0x00000020);
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 10 , Column= 18*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER9, ~((uint32_t)0x00000040), (uint32_t)0x00000040);
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 10 , Column= 19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER9, ~((uint32_t)0x00000080), (uint32_t)0x00000080);
          break;

        default:
          break;
      }
    break;
  }

  /*!< Request LCD RAM update */
  HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/**
  * @brief  Set Matrix Pixel off.
  * @param  PixelRow: Specify Matrix Row.
  * @param  PixelColumn: Specify Matrix Column.
  * @retval None
  */
void BSP_LCD_GLASS_ClearMatrixPixel(PixelRow_TypeDef PixelRow, PixelColumn_TypeDef PixelColumn)
{
  switch (PixelRow)
  {
    case PIXELROW_1:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 1 , Column= 1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFDFF, 0);
          break;

        case PIXELCOLUMN_2:
          /* Position : Row = 1 , Column= 2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFBFFF, 0);
          break;

        case PIXELCOLUMN_3:
          /* Position : Row = 1 , Column= 3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFDFFF, 0);
          break;

        case PIXELCOLUMN_4:
          /* Position : Row = 1 , Column= 4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFEFFF, 0);
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 1 , Column= 5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFDFFFF, 0);
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 1 , Column= 6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFEFFFF, 0);
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 1 , Column= 7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFF7FFF, 0);
          break;

        case PIXELCOLUMN_8:
          /* Position : Row = 1 , Column= 8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFEFFFFF, 0);
          break;

        case PIXELCOLUMN_9:
          /* Position : Row = 1 , Column= 9 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFF7FFFF, 0);
          break;

        case PIXELCOLUMN_10:
          /* Position : Row = 1 , Column= 10 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFBFFFF, 0);
          break;

        case PIXELCOLUMN_11:
          /* Position : Row = 1 , Column= 11 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFFB, 0);
          break;

        case PIXELCOLUMN_12:
          /* Position : Row = 1 , Column= 12 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFFD, 0);
          break;

        case PIXELCOLUMN_13:
          /* Position : Row = 1 , Column= 13 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFFE, 0);
          break;

        case PIXELCOLUMN_14:
          /* Position : Row = 1 , Column= 14 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFDF, 0);
          break;

        case PIXELCOLUMN_15:
          /* Position : Row = 1 , Column= 15 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFEF, 0);
          break;

        case PIXELCOLUMN_16:
          /* Position : Row = 1 , Column= 16 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFF7, 0);
          break;

        case PIXELCOLUMN_17:
          /* Position : Row = 1 , Column= 17 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFEFF, 0);
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 1 , Column= 18 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFF7F, 0);
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 1 , Column= 19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, (uint32_t)0xFFFFFFBF, 0);
          break;

        default:
          break;
      }
      break;

    case PIXELROW_2:

      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 2 , Column= 1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFFFDFF, 0);
          break;

        case PIXELCOLUMN_2:
          /* Position : Row = 2 , Column= 2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFFBFFF, 0);
          break;

        case PIXELCOLUMN_3:
          /* Position : Row = 2 , Column= 3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFFDFFF, 0);
          break;

        case PIXELCOLUMN_4:
          /* Position : Row = 2 , Column= 4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFFEFFF, 0);
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 2 , Column= 5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFDFFFF, 0);
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 2 , Column= 6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFEFFFF, 0);
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 2 , Column= 7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFF7FFF, 0);
          break;

        case PIXELCOLUMN_8:
          /* Position : Row = 2 , Column= 8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFEFFFFF, 0);
          break;

        case PIXELCOLUMN_9:
          /* Position : Row = 2 , Column= 9 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFF7FFFF, 0);
          break;

        case PIXELCOLUMN_10:
          /* Position : Row = 2 , Column= 10 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFBFFFF, 0);
          break;

        case PIXELCOLUMN_11:
          /* Position : Row = 2 , Column= 11 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFFFFFB, 0);
          break;

        case PIXELCOLUMN_12:
          /* Position : Row = 2 , Column= 12 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, (uint32_t)0xFFFFFFFD, 0);
          break;

